balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F27J53.PIC
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG4L" edc:default="0xff" edc:desc="" edc:impl="0xff" edc:name="CONFIG4L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WPFP" edc:desc="Write/Erase Protect Page Start/End Location" edc:mask="0x7f" edc:name="WPFP" edc:nzwidth="7">
              <edc:DCRFieldSemantic edc:cname="PAGE_0" edc:desc="Write Protect Program Flash Page 0" edc:when="(field &amp; 0x7f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_1" edc:desc="Write Protect Program Flash Page 1" edc:when="(field &amp; 0x7f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_2" edc:desc="Write Protect Program Flash Page 2" edc:when="(field &amp; 0x7f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_3" edc:desc="Write Protect Program Flash Page 3" edc:when="(field &amp; 0x7f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_4" edc:desc="Write Protect Program Flash Page 4" edc:when="(field &amp; 0x7f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_5" edc:desc="Write Protect Program Flash Page 5" edc:when="(field &amp; 0x7f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_6" edc:desc="Write Protect Program Flash Page 6" edc:when="(field &amp; 0x7f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_7" edc:desc="Write Protect Program Flash Page 7" edc:when="(field &amp; 0x7f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_8" edc:desc="Write Protect Program Flash Page 8" edc:when="(field &amp; 0x7f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_9" edc:desc="Write Protect Program Flash Page 9" edc:when="(field &amp; 0x7f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_10" edc:desc="Write Protect Program Flash Page 10" edc:when="(field &amp; 0x7f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_11" edc:desc="Write Protect Program Flash Page 11" edc:when="(field &amp; 0x7f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_12" edc:desc="Write Protect Program Flash Page 12" edc:when="(field &amp; 0x7f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_13" edc:desc="Write Protect Program Flash Page 13" edc:when="(field &amp; 0x7f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_14" edc:desc="Write Protect Program Flash Page 14" edc:when="(field &amp; 0x7f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_15" edc:desc="Write Protect Program Flash Page 15" edc:when="(field &amp; 0x7f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_16" edc:desc="Write Protect Program Flash Page 16" edc:when="(field &amp; 0x7f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_17" edc:desc="Write Protect Program Flash Page 17" edc:when="(field &amp; 0x7f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_18" edc:desc="Write Protect Program Flash Page 18" edc:when="(field &amp; 0x7f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_19" edc:desc="Write Protect Program Flash Page 19" edc:when="(field &amp; 0x7f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_20" edc:desc="Write Protect Program Flash Page 20" edc:when="(field &amp; 0x7f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_21" edc:desc="Write Protect Program Flash Page 21" edc:when="(field &amp; 0x7f) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_22" edc:desc="Write Protect Program Flash Page 22" edc:when="(field &amp; 0x7f) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_23" edc:desc="Write Protect Program Flash Page 23" edc:when="(field &amp; 0x7f) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_24" edc:desc="Write Protect Program Flash Page 24" edc:when="(field &amp; 0x7f) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_25" edc:desc="Write Protect Program Flash Page 25" edc:when="(field &amp; 0x7f) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_26" edc:desc="Write Protect Program Flash Page 26" edc:when="(field &amp; 0x7f) == 0x1a"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_27" edc:desc="Write Protect Program Flash Page 27" edc:when="(field &amp; 0x7f) == 0x1b"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_28" edc:desc="Write Protect Program Flash Page 28" edc:when="(field &amp; 0x7f) == 0x1c"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_29" edc:desc="Write Protect Program Flash Page 29" edc:when="(field &amp; 0x7f) == 0x1d"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_30" edc:desc="Write Protect Program Flash Page 30" edc:when="(field &amp; 0x7f) == 0x1e"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_31" edc:desc="Write Protect Program Flash Page 31" edc:when="(field &amp; 0x7f) == 0x1f"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_32" edc:desc="Write Protect Program Flash Page 32" edc:when="(field &amp; 0x7f) == 0x20"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_33" edc:desc="Write Protect Program Flash Page 33" edc:when="(field &amp; 0x7f) == 0x21"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_34" edc:desc="Write Protect Program Flash Page 34" edc:when="(field &amp; 0x7f) == 0x22"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_35" edc:desc="Write Protect Program Flash Page 35" edc:when="(field &amp; 0x7f) == 0x23"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_36" edc:desc="Write Protect Program Flash Page 36" edc:when="(field &amp; 0x7f) == 0x24"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_37" edc:desc="Write Protect Program Flash Page 37" edc:when="(field &amp; 0x7f) == 0x25"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_38" edc:desc="Write Protect Program Flash Page 38" edc:when="(field &amp; 0x7f) == 0x26"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_39" edc:desc="Write Protect Program Flash Page 39" edc:when="(field &amp; 0x7f) == 0x27"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_40" edc:desc="Write Protect Program Flash Page 40" edc:when="(field &amp; 0x7f) == 0x28"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_41" edc:desc="Write Protect Program Flash Page 41" edc:when="(field &amp; 0x7f) == 0x29"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_42" edc:desc="Write Protect Program Flash Page 42" edc:when="(field &amp; 0x7f) == 0x2a"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_43" edc:desc="Write Protect Program Flash Page 43" edc:when="(field &amp; 0x7f) == 0x2b"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_44" edc:desc="Write Protect Program Flash Page 44" edc:when="(field &amp; 0x7f) == 0x2c"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_45" edc:desc="Write Protect Program Flash Page 45" edc:when="(field &amp; 0x7f) == 0x2d"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_46" edc:desc="Write Protect Program Flash Page 46" edc:when="(field &amp; 0x7f) == 0x2e"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_47" edc:desc="Write Protect Program Flash Page 47" edc:when="(field &amp; 0x7f) == 0x2f"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_48" edc:desc="Write Protect Program Flash Page 48" edc:when="(field &amp; 0x7f) == 0x30"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_49" edc:desc="Write Protect Program Flash Page 49" edc:when="(field &amp; 0x7f) == 0x31"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_50" edc:desc="Write Protect Program Flash Page 50" edc:when="(field &amp; 0x7f) == 0x32"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_51" edc:desc="Write Protect Program Flash Page 51" edc:when="(field &amp; 0x7f) == 0x33"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_52" edc:desc="Write Protect Program Flash Page 52" edc:when="(field &amp; 0x7f) == 0x34"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_53" edc:desc="Write Protect Program Flash Page 53" edc:when="(field &amp; 0x7f) == 0x35"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_54" edc:desc="Write Protect Program Flash Page 54" edc:when="(field &amp; 0x7f) == 0x36"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_55" edc:desc="Write Protect Program Flash Page 55" edc:when="(field &amp; 0x7f) == 0x37"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_56" edc:desc="Write Protect Program Flash Page 56" edc:when="(field &amp; 0x7f) == 0x38"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_57" edc:desc="Write Protect Program Flash Page 57" edc:when="(field &amp; 0x7f) == 0x39"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_58" edc:desc="Write Protect Program Flash Page 58" edc:when="(field &amp; 0x7f) == 0x3a"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_59" edc:desc="Write Protect Program Flash Page 59" edc:when="(field &amp; 0x7f) == 0x3b"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_60" edc:desc="Write Protect Program Flash Page 60" edc:when="(field &amp; 0x7f) == 0x3c"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_61" edc:desc="Write Protect Program Flash Page 61" edc:when="(field &amp; 0x7f) == 0x3d"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_62" edc:desc="Write Protect Program Flash Page 62" edc:when="(field &amp; 0x7f) == 0x3e"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_63" edc:desc="Write Protect Program Flash Page 63" edc:when="(field &amp; 0x7f) == 0x3f"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_64" edc:desc="Write Protect Program Flash Page 64" edc:when="(field &amp; 0x7f) == 0x40"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_65" edc:desc="Write Protect Program Flash Page 65" edc:when="(field &amp; 0x7f) == 0x41"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_66" edc:desc="Write Protect Program Flash Page 66" edc:when="(field &amp; 0x7f) == 0x42"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_67" edc:desc="Write Protect Program Flash Page 67" edc:when="(field &amp; 0x7f) == 0x43"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_68" edc:desc="Write Protect Program Flash Page 68" edc:when="(field &amp; 0x7f) == 0x44"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_69" edc:desc="Write Protect Program Flash Page 69" edc:when="(field &amp; 0x7f) == 0x45"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_70" edc:desc="Write Protect Program Flash Page 70" edc:when="(field &amp; 0x7f) == 0x46"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_71" edc:desc="Write Protect Program Flash Page 71" edc:when="(field &amp; 0x7f) == 0x47"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_72" edc:desc="Write Protect Program Flash Page 72" edc:when="(field &amp; 0x7f) == 0x48"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_73" edc:desc="Write Protect Program Flash Page 73" edc:when="(field &amp; 0x7f) == 0x49"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_74" edc:desc="Write Protect Program Flash Page 74" edc:when="(field &amp; 0x7f) == 0x4a"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_75" edc:desc="Write Protect Program Flash Page 75" edc:when="(field &amp; 0x7f) == 0x4b"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_76" edc:desc="Write Protect Program Flash Page 76" edc:when="(field &amp; 0x7f) == 0x4c"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_77" edc:desc="Write Protect Program Flash Page 77" edc:when="(field &amp; 0x7f) == 0x4d"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_78" edc:desc="Write Protect Program Flash Page 78" edc:when="(field &amp; 0x7f) == 0x4e"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_79" edc:desc="Write Protect Program Flash Page 79" edc:when="(field &amp; 0x7f) == 0x4f"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_80" edc:desc="Write Protect Program Flash Page 80" edc:when="(field &amp; 0x7f) == 0x50"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_81" edc:desc="Write Protect Program Flash Page 81" edc:when="(field &amp; 0x7f) == 0x51"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_82" edc:desc="Write Protect Program Flash Page 82" edc:when="(field &amp; 0x7f) == 0x52"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_83" edc:desc="Write Protect Program Flash Page 83" edc:when="(field &amp; 0x7f) == 0x53"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_84" edc:desc="Write Protect Program Flash Page 84" edc:when="(field &amp; 0x7f) == 0x54"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_85" edc:desc="Write Protect Program Flash Page 85" edc:when="(field &amp; 0x7f) == 0x55"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_86" edc:desc="Write Protect Program Flash Page 86" edc:when="(field &amp; 0x7f) == 0x56"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_87" edc:desc="Write Protect Program Flash Page 87" edc:when="(field &amp; 0x7f) == 0x57"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_88" edc:desc="Write Protect Program Flash Page 88" edc:when="(field &amp; 0x7f) == 0x58"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_89" edc:desc="Write Protect Program Flash Page 89" edc:when="(field &amp; 0x7f) == 0x59"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_90" edc:desc="Write Protect Program Flash Page 90" edc:when="(field &amp; 0x7f) == 0x5a"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_91" edc:desc="Write Protect Program Flash Page 91" edc:when="(field &amp; 0x7f) == 0x5b"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_92" edc:desc="Write Protect Program Flash Page 92" edc:when="(field &amp; 0x7f) == 0x5c"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_93" edc:desc="Write Protect Program Flash Page 93" edc:when="(field &amp; 0x7f) == 0x5d"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_94" edc:desc="Write Protect Program Flash Page 94" edc:when="(field &amp; 0x7f) == 0x5e"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_95" edc:desc="Write Protect Program Flash Page 95" edc:when="(field &amp; 0x7f) == 0x5f"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_96" edc:desc="Write Protect Program Flash Page 96" edc:when="(field &amp; 0x7f) == 0x60"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_97" edc:desc="Write Protect Program Flash Page 97" edc:when="(field &amp; 0x7f) == 0x61"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_98" edc:desc="Write Protect Program Flash Page 98" edc:when="(field &amp; 0x7f) == 0x62"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_99" edc:desc="Write Protect Program Flash Page 99" edc:when="(field &amp; 0x7f) == 0x63"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_100" edc:desc="Write Protect Program Flash Page 100" edc:when="(field &amp; 0x7f) == 0x64"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_101" edc:desc="Write Protect Program Flash Page 101" edc:when="(field &amp; 0x7f) == 0x65"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_102" edc:desc="Write Protect Program Flash Page 102" edc:when="(field &amp; 0x7f) == 0x66"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_103" edc:desc="Write Protect Program Flash Page 103" edc:when="(field &amp; 0x7f) == 0x67"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_104" edc:desc="Write Protect Program Flash Page 104" edc:when="(field &amp; 0x7f) == 0x68"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_105" edc:desc="Write Protect Program Flash Page 105" edc:when="(field &amp; 0x7f) == 0x69"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_106" edc:desc="Write Protect Program Flash Page 106" edc:when="(field &amp; 0x7f) == 0x6a"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_107" edc:desc="Write Protect Program Flash Page 107" edc:when="(field &amp; 0x7f) == 0x6b"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_108" edc:desc="Write Protect Program Flash Page 108" edc:when="(field &amp; 0x7f) == 0x6c"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_109" edc:desc="Write Protect Program Flash Page 109" edc:when="(field &amp; 0x7f) == 0x6d"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_110" edc:desc="Write Protect Program Flash Page 110" edc:when="(field &amp; 0x7f) == 0x6e"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_111" edc:desc="Write Protect Program Flash Page 111" edc:when="(field &amp; 0x7f) == 0x6f"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_112" edc:desc="Write Protect Program Flash Page 112" edc:when="(field &amp; 0x7f) == 0x70"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_113" edc:desc="Write Protect Program Flash Page 113" edc:when="(field &amp; 0x7f) == 0x71"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_114" edc:desc="Write Protect Program Flash Page 114" edc:when="(field &amp; 0x7f) == 0x72"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_115" edc:desc="Write Protect Program Flash Page 115" edc:when="(field &amp; 0x7f) == 0x73"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_116" edc:desc="Write Protect Program Flash Page 116" edc:when="(field &amp; 0x7f) == 0x74"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_117" edc:desc="Write Protect Program Flash Page 117" edc:when="(field &amp; 0x7f) == 0x75"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_118" edc:desc="Write Protect Program Flash Page 118" edc:when="(field &amp; 0x7f) == 0x76"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_119" edc:desc="Write Protect Program Flash Page 119" edc:when="(field &amp; 0x7f) == 0x77"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_120" edc:desc="Write Protect Program Flash Page 120" edc:when="(field &amp; 0x7f) == 0x78"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_121" edc:desc="Write Protect Program Flash Page 121" edc:when="(field &amp; 0x7f) == 0x79"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_122" edc:desc="Write Protect Program Flash Page 122" edc:when="(field &amp; 0x7f) == 0x7a"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_123" edc:desc="Write Protect Program Flash Page 123" edc:when="(field &amp; 0x7f) == 0x7b"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_124" edc:desc="Write Protect Program Flash Page 124" edc:when="(field &amp; 0x7f) == 0x7c"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_125" edc:desc="Write Protect Program Flash Page 125" edc:when="(field &amp; 0x7f) == 0x7d"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_126" edc:desc="Write Protect Program Flash Page 126" edc:when="(field &amp; 0x7f) == 0x7e"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_127" edc:desc="Write Protect Program Flash Page 127" edc:when="(field &amp; 0x7f) == 0x7f"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPCFG" edc:desc="Write/Erase Protect Configuration Region " edc:mask="0x1" edc:name="WPCFG" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Configuration Words page not erase/write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Configuration Words page erase/write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="----n-nn" edc:cname="CONFIG4H" edc:default="0xfb" edc:desc="" edc:impl="0xb" edc:name="CONFIG4H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xfb">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WPDIS" edc:desc="Write Protect Disable bit" edc:mask="0x1" edc:name="WPDIS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WPFP&lt;6:0&gt;/WPEND region ignored" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WPFP&lt;6:0&gt;/WPEND region erase/write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPEND" edc:desc="Write/Erase Protect Region Select bit (valid when WPDIS = 0)" edc:mask="0x1" edc:name="WPEND" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="PAGE_WPFP" edc:desc="Pages WPFP&lt;6:0&gt; through Configuration Words erase/write protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_0" edc:desc="Pages 0 through WPFP&lt;6:0&gt; erase/write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="LS48MHZ" edc:desc="Low Speed USB mode with 48 MHz system clock bit" edc:mask="0x1" edc:name="LS48MHZ" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="SYS24X4" edc:desc="System clock at 24 MHz USB CLKEN divide-by is set to 4" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="SYS48X8" edc:desc="System clock at 48 MHz USB CLKEN divide-by is set to 8" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="" edc:ishidden="true" edc:mask="0xf" edc:name="RESERVED" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
